import re

re_str_1 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).+(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|))))'
re_str_2 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).+(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|))).*)$'
re_str_3 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).*(?=.+涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|))))'
re_1 = re.compile(re_str_1)
re_2 = re.compile(re_str_2)
re_3 = re.compile(re_str_3)

res_1 = re_1.findall('行长')  # [('', '行长')]
res_2 = re_2.findall('行长')  # [('行长', '行长')]
res_3 = re_3.findall('行长')  # [('', '行长')]

# res_2 = re_2.findall('行')  # []
# print(res_1)
# print(res_2)
# print(res_3)


# re_str_4 = 'abc(?=def)'
# re_4 = re.compile(re_str_4)
# res_4 = re_4.findall('abcxyz')  # []
# res_5 = re_4.findall('abcdef')  # ['abc']
# res_6 = re_4.findall('abcdefdddef')  # ['abc']
# res_7 = re_4.findall('abc')  # []
# print(res_4)
# print(res_5)
# print(res_6)
# print(res_7)


# re_str_4 = 'abc.*(?=def)'
# re_4 = re.compile(re_str_4)
# res_4 = re_4.findall('abcxyz')  # []
# res_5 = re_4.findall('abcdef')  # ['abc']
# res_6 = re_4.findall('abcdefdddef')  # ['abcdefdd']
# res_7 = re_4.findall('abc')  # []
# print(res_4)
# print(res_5)
# print(res_6)
# print(res_7)

# re_str_4 = '^(.*(?=(.*(?=c|b).*(?=def))))'
# # re_str_4 = '^(.*(?=(.*(?=abc|b).*(?=def))).*)$'
# re_4 = re.compile(re_str_4)
# res_4 = re_4.findall('abcxyz')  # []
# res_5 = re_4.findall('abcdef')  # [('ab', 'c')]
# res_6 = re_4.findall('abcdefdddef')  # [('ab', 'cdefdd')]
# res_7 = re_4.findall('abc')  # []
# print(res_4)
# print(res_5)
# print(res_6)
# print(res_7)

# re_str_4 = '^(.*(?=(.*(?=abc|b).*(?=def))).*)$'
# re_4 = re.compile(re_str_4)
# res_4 = re_4.findall('abcxyz')  # []
# res_5 = re_4.findall('abcdef')  # [('abcdef', 'bc')]
# res_6 = re_4.findall('abcdefdddef')  # [('abcdefdddef', 'bcdefdd')]
# res_7 = re_4.findall('abc')  # []
# print(res_4)
# print(res_5)
# print(res_6)
# print(res_7)

# 解决'高管风险'问题
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def))).*)$'
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def))))'
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def|))))'  # 问题出现在最后一个或'|'上！！！
# # re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).+(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|))))'
# # re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).*(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除))))'
# re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).*(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|落马|拘留|立案|刑事|被带走|跑路||被查|调查|审查|停职|警示|责令|通报|开除|失联|禁入|公诉|去世|离世|辞世|刑拘|出事|获刑).*)).*)$'
# re_4 = re.compile(re_str_4)
# # res_4 = re_4.findall('abcxyz')  # []
# # res_5 = re_4.findall('abcdef')  # [('abcdef', 'bc')]=
# # res_6 = re_4.findall('abcdefdddef')  # [('abcdefdddef', 'bcdefdd')]
# # res_7 = re_4.findall('abc')  # []
# res_8 = re_4.findall('行长')  # '开除'后面有'|'就能匹配出行长！没有'|'时单独的'行长'就匹配不上！！！
# res_9 = re_4.findall('行长涉嫌')  # '开除'后面有'|'就能匹配出行长！没有'|'时单独的'行长'就匹配不上！！！
# # print(res_4)
# # print(res_5)
# # print(res_6)
# # print(res_7)
# print(res_8)
# print(res_9)

# # 解决'高管变更'问题
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def))).*)$'
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def))))'
# re_str_4 = '^(.*(?=(.*(?=abc).*(?=def|))))'  # 问题出现在最后一个或'|'上！！！
# # re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).+(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|))))'
# # re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).*(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除))))'
# # re_str_4 = '^(.*(?=(.*(?=董监高|高级管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|监事|法人|法定代表人|书记|行长|主任|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|官员).*(?=涉嫌|违法|违纪|非法获利|行贿|犯罪|受贿|贪污|患病|意外事故|监管关注|罢免|免职|开除党籍|问责|处罚|处分|双开|限制消费|被执行人|强制措施|撤职|逮捕|通缉|开除|落马|拘留|立案|刑事|被带走|跑路||被查|调查|审查|停职|警示|责令|通报|开除|失联|禁入|公诉|去世|离世|辞世|刑拘|出事|获刑).*)).*)$'
# re_str_4 = '^(.*(?=(.*(?=董监高|管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|独董|监事|法人|法定代表人|书记|行长|主任|重大人事|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|元老|核心技术人员|总会计师|证券事务代表|首席信息官|大当家|二当家).*(?=调整|变化|变动|变更|更换|辞职|离任|离职|请辞|辞去|免去|不再担任|拟任|接任|辞任|聘任|))))'
# re_str_4 = '^(.*(?=(.*(?=董监高|管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|独董|监事|法人|法定代表人|书记|行长|主任|重大人事|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|元老|核心技术人员|总会计师|证券事务代表|首席信息官|大当家|二当家).*(?=调整|变化|变动|变更|更换|辞职|离任|离职|请辞|辞去|免去|不再担任|拟任|接任|辞任|聘任|卸任|离任|赴任|升任|补选|退位|选举|新聘|选聘|任|接棒|换人|退休|提名|调动).*)).*)$'
# # re_str_4 = '^(.*(?=(.*(?=董监高|管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|独董|监事|法人|法定代表人|书记|行长|主任|重大人事|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|元老|核心技术人员|总会计师|证券事务代表|首席信息官|大当家|二当家).*(?=调整|变化|变动|变更|更换|辞职|离任|离职|请辞|辞去|免去|不再担任|拟任|接任|辞任|聘任|卸任|离任|赴任|升任|补选|退位|选举|新聘|选聘|任|接棒|换人|退休|提名|调动).*)).*)$'
# re_4 = re.compile(re_str_4)
# # res_7 = re_4.findall('abc')  # []
# res_8 = re_4.findall('行长')
# res_9 = re_4.findall('行长涉嫌')
# # # print(res_7)
# # print(res_8)
# # print(res_9)
#
# baohan = '^(.*(?=(.*(?=董监高|管理人员|高管|董事长|总经理.+|总裁|CEO|总监|董事|独董|监事|法人|法定代表人|书记|行长|主任.+|重大人事|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|元老|核心技术人员|总会计师|证券事务代表|首席信息官|大当家|二当家).*(?=调整|变化|变动|变更|更换|辞职|离任|离职|请辞|辞去|免去|不再担任|拟任|接任|辞任|聘任|卸任|离任|赴任|升任|补选|退位|选举|新聘|选聘|任|接棒|换人|退休|提名|调动).*)).*)$'
# # baohan = '^(.*(?=(.*(?=董监高|管理人员|高管|董事长|总经理|总裁|CEO|总监|董事|独董|监事|法人|法定代表人|书记|行长|主任|重大人事|领导|董秘|财务负责人|总工|非执行董事|非执董|负责人|责任人|元老|核心技术人员|总会计师|证券事务代表|首席信息官|大当家|二当家).*(?=调整|变化|变动|变更|更换|辞职|离任|离职|请辞|辞去|免去|不再担任|拟任|接任|辞任|聘任|卸任|离任|赴任|升任|补选|退位|选举|新聘|选聘|任|接棒|换人|退休|提名|调动).*)).*)$'
# # res = re.findall(baohan, '主任')
# # print(res)
#
# re_str_2 = re.compile(baohan)
# res_1 = re_str_2.findall('主任')
# res_2 = re_str_2.findall('法任')
# res_3 = re_str_2.findall('主事任')
# res_4 = re_str_2.findall('主任任')
# res_5 = re_str_2.findall('总经理任')
# print(res_1)
# print(res_2)
# print(res_3)
# print(res_4)
# print(res_5)

# # 解决 实控人/股东变动 问题
# # baohan = '^(.*(?=(.*(?=无[控股股东|实际控制人|实控人|大股东]).*)).*)$'
# # baohan = '^(.*(?=(.*(?=无控股股东|实际控制人|实控人|大股东).*)).*)$'
# # baohan = '^(.*(?=(.*(?=(?:无控股股东|无实际控制人|无实控人|无大股东)).*)).*)$'  # ?:非捕获组
# baohan = '^(.*(?=(.*(?=无(?=控股股东|实际控制人|实控人|大股东)).*)).*)$'  # ?=前向肯定环视
# re_str = re.compile(baohan)
# res_1 = re_str.findall('无人')  # []
# res_2 = re_str.findall('无控股股东')  # [('无控股股东', '无控股股东')]
# res_3 = re_str.findall('实控人')  # []
# res_4 = re_str.findall('无实人')  # []
#
# print(res_1)
# print(res_2)
# print(res_3)
# print(res_4)

# # 级别展望上调  -- [上调,升,调高]*[信用等级,评级,级别];[信用等级,评级,级别]*[上调,升,调高];[展望,信用等级,调整]*1;
# # 级别展望上调  -- [上调,升,调高]*[信用等级,评级,级别];[信用等级,评级,级别]*[上调,升,调高];[展望,信用等级,调整]*正面;
# baohan = '^(.*(?=(.*(?=展望|信用等级|调整).*(?=正面).*)).*)$'  #
# re_str = re.compile(baohan)
# res_1 = re_str.findall('调整“23三亚01”部分募集资金用途的公告')  #
#
# print(res_1)


# baohan = '^(.*(?=(.*(?=[泰慕士针纺科技]).*(?=跌).*(?=.*%).*)).*)$'  #
baohan = '^(.*(?=(.*(?=[江苏泰慕士针纺科技]).*(?=跌).*(?=.*%).*)).*)$'  #
re_str = re.compile(baohan)
res_1 = re_str.findall('A股异动丨泰慕士续跌8%5日连跌超30%业绩下滑江苏泰慕士针纺科技')  #

print(res_1)








